fun main() {

    val dictionary = Dictionary()

    var wins = 0
    var loses = 0


    println(
        """
        *****************************************
        *   Добро пожаловать в игру "Виселица"  *
        *****************************************
        
         Вам необходимо отгадать слово по буквам.
              6 ошибок - и вы проиграете!
                     Удачи! :)
        *****************************************             
                     
    """.trimIndent()
    )

    while (true) {

        println("Для начала новой игры введите - [1], для выхода - [0]")

        when (readln()) {

            1.toString() -> {
                val gameLoop = GameLoop(dictionary.getRandomWord())
                if (gameLoop.loadGameLoop()) wins++ else loses++
            }

            0.toString() -> break
            else -> {
                println("Вы ввели недопустимое значение. Попробуйте ещё раз!"); continue
            }
        }

        println("Ваша статистика: ПОБЕДЫ - [$wins] / ПОРАЖЕНИЯ - [$loses]\n")
        print("Сыграем ещё раз? ")
    }

    println(
        """
        ******************************************
        *   До новых встреч в игре "Виселица"!   *
        ******************************************
    """.trimIndent()
    )
}

